#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; WPOSITION                0   xyzw        0     NONE   float       
; VPOSITION                0   xyzw        1     NONE   float       
; NORMAL                   0   xyz         2     NONE   float       
; NORMAL                   1   xyz         3     NONE   float       
; TEXCOORD                 0   xy          4     NONE   float       
; TEXCOORD                 1   xyz         5     NONE   float       
; SV_Position              0   xyzw        6      POS   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 2e2b1767f834c70ae507b82079154d52.lld
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; WPOSITION                0                 linear       
; VPOSITION                0                 linear       
; NORMAL                   0                 linear       
; NORMAL                   1                 linear       
; TEXCOORD                 0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !81)
!1 = !DIFile(filename: "Shaders\5CShaders\5CStandardPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !6, templateParams: !21)
!6 = !{!7, !9, !17}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !5, file: !1, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QBAAAMI@Z", scope: !5, file: !1, type: !10, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !16}
!12 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !13)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QAAAAMI@Z", scope: !5, file: !1, type: !18, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!12, !20, !16}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !13)
!23 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !26, templateParams: !37)
!26 = !{!27, !28, !33}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !25, file: !1, baseType: !8, size: 32, align: 32)
!28 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QBAAAMI@Z", scope: !25, file: !1, type: !29, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!29 = !DISubroutineType(types: !30)
!30 = !{!12, !31, !16}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!33 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QAAAAMI@Z", scope: !25, file: !1, type: !34, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!34 = !DISubroutineType(types: !35)
!35 = !{!12, !36, !16}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!37 = !{!22, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!39 = !{!40, !68, !72, !75, !78}
!40 = !DISubprogram(name: "main", scope: !41, file: !41, line: 68, type: !42, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!41 = !DIFile(filename: "Shaders\5CStandardPS.hlsl", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!24, !44}
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !41, line: 57, size: 736, align: 32, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !66, !67}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "positionWS", scope: !44, file: !41, line: 59, baseType: !24, size: 128, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "positionVS", scope: !44, file: !41, line: 60, baseType: !24, size: 128, align: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "normalVS", scope: !44, file: !41, line: 61, baseType: !4, size: 96, align: 32, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "normalWS", scope: !44, file: !41, line: 62, baseType: !4, size: 96, align: 32, offset: 352)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "texCoord", scope: !44, file: !41, line: 63, baseType: !51, size: 64, align: 32, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !53, templateParams: !64)
!53 = !{!54, !55, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !52, file: !1, baseType: !8, size: 32, align: 32)
!55 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QBAAAMI@Z", scope: !52, file: !1, type: !56, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!12, !58, !16}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!60 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QAAAAMI@Z", scope: !52, file: !1, type: !61, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{!12, !63, !16}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!64 = !{!22, !65}
!65 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "viewDirWS", scope: !44, file: !41, line: 64, baseType: !4, size: 96, align: 32, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !44, file: !41, line: 65, baseType: !24, size: 128, align: 32, offset: 608)
!68 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !69, file: !69, line: 13, type: !70, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DIFile(filename: "Shaders/BRDFFunctions.hlsli", directory: "")
!70 = !DISubroutineType(types: !71)
!71 = !{!13, !4, !4, !13}
!72 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMMMM@Z", scope: !69, file: !69, line: 52, type: !73, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubroutineType(types: !74)
!74 = !{!13, !13, !13, !13}
!75 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !69, file: !69, line: 36, type: !76, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!13, !13, !13}
!78 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !69, file: !69, line: 68, type: !79, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!4, !13, !4}
!81 = !{!82, !84, !86, !87, !91, !93, !95}
!82 = !DIGlobalVariable(name: "Epsilon", scope: !0, file: !41, line: 9, type: !83, isLocal: true, isDefinition: true, variable: float 0x3EE4F8B580000000)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!84 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !41, line: 7, type: !85, isLocal: true, isDefinition: true)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!86 = !DIGlobalVariable(name: "Epsilon", scope: !0, file: !41, line: 9, type: !83, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariable(name: "LinearRepeatSampler", linkageName: "\01?LinearRepeatSampler@@3USamplerState@@A", scope: !0, file: !41, line: 54, type: !88, isLocal: false, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 54, size: 32, align: 32, elements: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !88, file: !1, line: 54, baseType: !8, size: 32, align: 32, flags: DIFlagPrivate)
!91 = !DIGlobalVariable(name: "Fdielectric.0", linkageName: "Fdielectric.0", scope: !0, file: !41, line: 7, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !85, size: 32, align: 4)
!93 = !DIGlobalVariable(name: "Fdielectric.1", linkageName: "Fdielectric.1", scope: !0, file: !41, line: 7, type: !94, isLocal: false, isDefinition: true)
!94 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !85, size: 32, align: 4, offset: 32)
!95 = !DIGlobalVariable(name: "Fdielectric.2", linkageName: "Fdielectric.2", scope: !0, file: !41, line: 7, type: !96, isLocal: false, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !85, size: 32, align: 4, offset: 64)
!97 = !{i32 2, !"Dwarf Version", i32 4}
!98 = !{i32 2, !"Debug Info Version", i32 3}
!99 = !{!"dxc 1.2"}
