#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float       
; NORMAL                   0   xyz         1     NONE   float       
; TEXCOORD                 0   xy          2     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; WPOSITION                0   xyzw        0     NONE   float   xyzw
; VPOSITION                0   xyzw        1     NONE   float   xyzw
; NORMAL                   0   xyz         2     NONE   float   xyz 
; NORMAL                   1   xyz         3     NONE   float   xyz 
; TEXCOORD                 0   xy          4     NONE   float   xy  
; TEXCOORD                 1   xyz         5     NONE   float   xyz 
; SV_Position              0   xyzw        6      POS   float   xyzw
;
; shader debug name: 9d5526bae2fd32b93c949f5b2f17eef8.lld
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; NORMAL                   0                              
; TEXCOORD                 0                              
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !59)
!1 = !DIFile(filename: "Shaders\5CShaders\5CStandardVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !21)
!6 = !{!7, !9, !17}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !5, file: !1, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QBAAAMI@Z", scope: !5, file: !1, type: !10, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !16}
!12 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !13)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QAAAAMI@Z", scope: !5, file: !1, type: !18, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!12, !20, !16}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !13)
!23 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 37, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 37, size: 288, align: 32, elements: !26, templateParams: !56)
!26 = !{!27, !32, !51}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !25, file: !1, line: 37, baseType: !28, size: 288, align: 32)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 288, align: 32, elements: !30)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 96, align: 32, flags: DIFlagVector, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 3)
!32 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$matrix@M$02$02@@QAAAAV?$vector@M$02@@I@Z", scope: !25, file: !1, line: 37, type: !33, isLocal: false, isDefinition: false, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !50, !16}
!35 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !37, templateParams: !48)
!37 = !{!38, !39, !44}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !36, file: !1, baseType: !8, size: 32, align: 32)
!39 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QBAAAMI@Z", scope: !36, file: !1, type: !40, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!40 = !DISubroutineType(types: !41)
!41 = !{!12, !42, !16}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!44 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QAAAAMI@Z", scope: !36, file: !1, type: !45, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!12, !47, !16}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!48 = !{!22, !49}
!49 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!51 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$matrix@M$02$02@@QBAAAV?$vector@M$02@@I@Z", scope: !25, file: !1, line: 37, type: !52, isLocal: false, isDefinition: false, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!35, !54, !16}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!56 = !{!22, !57, !58}
!57 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 3)
!58 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 3)
!59 = !{!60}
!60 = !DISubprogram(name: "main", scope: !61, file: !61, line: 29, type: !62, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!61 = !DIFile(filename: "Shaders\5CStandardVS.hlsl", directory: "")
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !89}
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !61, line: 18, size: 736, align: 32, elements: !65)
!65 = !{!66, !67, !68, !70, !71, !87, !88}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "positionWS", scope: !64, file: !61, line: 20, baseType: !4, size: 128, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "positionVS", scope: !64, file: !61, line: 21, baseType: !4, size: 128, align: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "normalVS", scope: !64, file: !61, line: 22, baseType: !69, size: 96, align: 32, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !36)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "normalWS", scope: !64, file: !61, line: 23, baseType: !69, size: 96, align: 32, offset: 352)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "texCoord", scope: !64, file: !61, line: 24, baseType: !72, size: 64, align: 32, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !74, templateParams: !85)
!74 = !{!75, !76, !81}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !73, file: !1, baseType: !8, size: 32, align: 32)
!76 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QBAAAMI@Z", scope: !73, file: !1, type: !77, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!77 = !DISubroutineType(types: !78)
!78 = !{!12, !79, !16}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!81 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QAAAAMI@Z", scope: !73, file: !1, type: !82, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!12, !84, !16}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!85 = !{!22, !86}
!86 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "viewDirWS", scope: !64, file: !61, line: 25, baseType: !69, size: 96, align: 32, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !64, file: !61, line: 26, baseType: !4, size: 128, align: 32, offset: 608)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !61, line: 10, size: 256, align: 32, elements: !90)
!90 = !{!91, !92, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !89, file: !61, line: 12, baseType: !69, size: 96, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !89, file: !61, line: 13, baseType: !69, size: 96, align: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "texCoord", scope: !89, file: !61, line: 14, baseType: !72, size: 64, align: 32, offset: 192)
!94 = !{i32 2, !"Dwarf Version", i32 4}
!95 = !{i32 2, !"Debug Info Version", i32 3}
!96 = !{!"dxc 1.2"}
!97 = !{!"Shaders\5CStandardVS.hlsl", !"// -- Parameters Begin ---\0D\0A\0D\0A#include \22StandardStructures.hlsli\22\0D\0A\0D\0AConstantBuffer<DrawCall> DrawCallCB : register(b0);\0D\0AConstantBuffer<SceneData> SceneDataCB : register(b2);\0D\0A\0D\0A// -- Parameters End ---\0D\0A\0D\0Astruct VSInput\0D\0A{\0D\0A    float3 position : POSITION;\0D\0A    float3 normal : NORMAL;\0D\0A    float2 texCoord : TEXCOORD;\0D\0A\0D\0A};\0D\0A\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4 positionWS : WPOSITION;\0D\0A    float4 positionVS : VPOSITION;\0D\0A    float3 normalVS : NORMAL;\0D\0A    float3 normalWS : NORMAL1;\0D\0A    float2 texCoord : TEXCOORD;\0D\0A    float3 viewDirWS : TEXCOORD1;\0D\0A    float4 position : SV_Position;\0D\0A};\0D\0A\0D\0AVSOutput main(VSInput input)\0D\0A{\0D\0A    VSOutput output;\0D\0A    \0D\0A    output.positionWS = mul(DrawCallCB.Transform, float4(input.position, 1.0f));\0D\0A    output.positionVS = mul(SceneDataCB.ViewMatrix, output.positionWS);\0D\0A    output.position = mul(SceneDataCB.ProjectionMatrix, output.positionVS);\0D\0A    \0D\0A    output.normalWS = mul((float3x3) DrawCallCB.Transform, input.normal);  \0D\0A    output.normalVS = mul((float3x3) SceneDataCB.ViewMatrix, output.normalWS);\0D\0A    \0D\0A    output.normalWS = normalize(output.normalWS);\0D\0A    output.normalVS = normalize(output.normalVS);\0D\0A    \0D\0A    output.texCoord = input.texCoord;\0D\0A    \0D\0A    output.viewDirWS = SceneDataCB.CameriaPosition - output.positionWS.xyz;\0D\0A    output.viewDirWS = normalize(output.viewDirWS);\0D\0A    \0D\0A    return output;\0D\0A}"}
!98 = !{!"Shaders/StandardStructures.hlsli", !"\0D\0A#ifndef __STANDARD_STRUCTURES_HLSLI__\0D\0A#define __STANDARD_STRUCTURES_HLSLI__\0D\0A\0D\0Astruct SceneData\0D\0A{\0D\0A    // -- Matrices ---\0D\0A    matrix ProjectionMatrix;\0D\0A    // ----------------------- (16 bit boundary)\0D\0A\09\0D\0A    matrix ViewMatrix;\0D\0A    // ----------------------- (16 bit boundary)\0D\0A    \0D\0A    // -- Camera Data ---\0D\0A    float3 CameriaPosition;\0D\0A    // ----------------------- (16 bit boundary)\0D\0A};\0D\0A\0D\0Astruct DrawCall\0D\0A{\0D\0A    matrix Transform;\0D\0A    // ----------------------- (16 bit boundary)\0D\0A};\0D\0A\0D\0A#endif"}
!99 = !{!"Shaders\5CStandardVS.hlsl"}
!100 = !{!"/E", !"main", !"/T", !"vs_6_0", !"/Zi"}
!101 = !{i32 1, i32 0}
!102 = !{i32 1, i32 4}
!103 = !{!"vs", i32 6, i32 0}
!104 = !{null, null, !105, null}
!105 = !{!106, !107}
!106 = !{i32 0, %dx.alignment.legacy.DrawCallCB* undef, !"DrawCallCB", i32 0, i32 0, i32 1, i32 64, null}
!107 = !{i32 1, %dx.alignment.legacy.SceneDataCB* undef, !"SceneDataCB", i32 0, i32 2, i32 1, i32 140, null}
!108 = !{i32 0, %struct.DrawCall undef, !109, %struct.SceneData undef, !112, %struct.VSOutput undef, !116, %struct.VSInput undef, !124, %DrawCallCB undef, !128, %SceneDataCB undef, !130, %dx.alignment.legacy.struct.DrawCall undef, !109, %dx.alignment.legacy.DrawCallCB undef, !128, %dx.alignment.legacy.struct.SceneData undef, !112, %dx.alignment.legacy.SceneDataCB undef, !130}
!109 = !{i32 64, !110}
!110 = !{i32 6, !"Transform", i32 2, !111, i32 3, i32 0, i32 7, i32 9}
!111 = !{i32 4, i32 4, i32 2}
!112 = !{i32 140, !113, !114, !115}
!113 = !{i32 6, !"ProjectionMatrix", i32 2, !111, i32 3, i32 0, i32 7, i32 9}
!114 = !{i32 6, !"ViewMatrix", i32 2, !111, i32 3, i32 64, i32 7, i32 9}
!115 = !{i32 6, !"CameriaPosition", i32 3, i32 128, i32 7, i32 9}
!116 = !{i32 112, !117, !118, !119, !120, !121, !122, !123}
!117 = !{i32 6, !"positionWS", i32 3, i32 0, i32 4, !"WPOSITION", i32 7, i32 9}
!118 = !{i32 6, !"positionVS", i32 3, i32 16, i32 4, !"VPOSITION", i32 7, i32 9}
!119 = !{i32 6, !"normalVS", i32 3, i32 32, i32 4, !"NORMAL", i32 7, i32 9}
