#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float       
; NORMAL                   0   xyz         1     NONE   float       
; TEXCOORD                 0   xy          2     NONE   float       
; SV_InstanceID            0   x           3   INSTID    uint       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; WPOSITION                0   xyzw        0     NONE   float   xyzw
; VPOSITION                0   xyzw        1     NONE   float   xyzw
; NORMAL                   0   xyz         2     NONE   float   xyz 
; NORMAL                   1   xyz         3     NONE   float   xyz 
; TEXCOORD                 0   xy          4     NONE   float   xy  
; TEXCOORD                 1   xyz         5     NONE   float   xyz 
; SV_Position              0   xyzw        6      POS   float   xyzw
;
; shader debug name: ad277b884784c19169529ec822e84c7b.lld
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; NORMAL                   0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !59, globals: !96)
!1 = !DIFile(filename: "Shaders\5CShaders\5CStandardVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !21)
!6 = !{!7, !9, !17}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !5, file: !1, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QBAAAMI@Z", scope: !5, file: !1, type: !10, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !16}
!12 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !13)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QAAAAMI@Z", scope: !5, file: !1, type: !18, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!12, !20, !16}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !13)
!23 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 48, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 48, size: 288, align: 32, elements: !26, templateParams: !56)
!26 = !{!27, !32, !51}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !25, file: !1, line: 48, baseType: !28, size: 288, align: 32)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 288, align: 32, elements: !30)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 96, align: 32, flags: DIFlagVector, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 3)
!32 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$matrix@M$02$02@@QAAAAV?$vector@M$02@@I@Z", scope: !25, file: !1, line: 48, type: !33, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !50, !16}
!35 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !37, templateParams: !48)
!37 = !{!38, !39, !44}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !36, file: !1, baseType: !8, size: 32, align: 32)
!39 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QBAAAMI@Z", scope: !36, file: !1, type: !40, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!40 = !DISubroutineType(types: !41)
!41 = !{!12, !42, !16}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!44 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QAAAAMI@Z", scope: !36, file: !1, type: !45, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!12, !47, !16}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!48 = !{!22, !49}
!49 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!51 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$matrix@M$02$02@@QBAAAV?$vector@M$02@@I@Z", scope: !25, file: !1, line: 48, type: !52, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!35, !54, !16}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!56 = !{!22, !57, !58}
!57 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 3)
!58 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 3)
!59 = !{!60}
!60 = !DISubprogram(name: "main", scope: !61, file: !61, line: 30, type: !62, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!61 = !DIFile(filename: "Shaders\5CStandardVS.hlsl", directory: "")
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !89}
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !61, line: 19, size: 736, align: 32, elements: !65)
!65 = !{!66, !67, !68, !70, !71, !87, !88}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "positionWS", scope: !64, file: !61, line: 21, baseType: !4, size: 128, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "positionVS", scope: !64, file: !61, line: 22, baseType: !4, size: 128, align: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "normalVS", scope: !64, file: !61, line: 23, baseType: !69, size: 96, align: 32, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !36)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "normalWS", scope: !64, file: !61, line: 24, baseType: !69, size: 96, align: 32, offset: 352)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "texCoord", scope: !64, file: !61, line: 25, baseType: !72, size: 64, align: 32, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !74, templateParams: !85)
!74 = !{!75, !76, !81}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !73, file: !1, baseType: !8, size: 32, align: 32)
!76 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QBAAAMI@Z", scope: !73, file: !1, type: !77, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!77 = !DISubroutineType(types: !78)
!78 = !{!12, !79, !16}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!81 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QAAAAMI@Z", scope: !73, file: !1, type: !82, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!12, !84, !16}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!85 = !{!22, !86}
!86 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "viewDirWS", scope: !64, file: !61, line: 26, baseType: !69, size: 96, align: 32, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !64, file: !61, line: 27, baseType: !4, size: 128, align: 32, offset: 608)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !61, line: 11, size: 288, align: 32, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !89, file: !61, line: 13, baseType: !69, size: 96, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !89, file: !61, line: 14, baseType: !69, size: 96, align: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "texCoord", scope: !89, file: !61, line: 15, baseType: !72, size: 64, align: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !89, file: !61, line: 16, baseType: !95, size: 32, align: 32, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !16)
!96 = !{!97}
!97 = !DIGlobalVariable(name: "InstanceWorldMatricesSB", linkageName: "\01?InstanceWorldMatricesSB@@3V?$StructuredBuffer@V?$matrix@M$03$03@@@@A", scope: !0, file: !61, line: 7, type: !98, isLocal: false, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<matrix<float, 4, 4> >", file: !1, line: 7, size: 512, align: 32, elements: !99, templateParams: !121)
!99 = !{!100}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !98, file: !1, line: 7, baseType: !101, size: 512, align: 32)
!101 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !102, templateParams: !118)
!102 = !{!103, !108, !113}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !101, file: !1, line: 34, baseType: !104, size: 512, align: 32)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 512, align: 32, elements: !106)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, align: 32, flags: DIFlagVector, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 4)
!108 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$matrix@M$03$03@@QAAAAV?$vector@M$03@@I@Z", scope: !101, file: !1, line: 34, type: !109, isLocal: false, isDefinition: false, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !112, !16}
!111 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !5)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!113 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$matrix@M$03$03@@QBAAAV?$vector@M$03@@I@Z", scope: !101, file: !1, line: 34, type: !114, isLocal: false, isDefinition: false, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!114 = !DISubroutineType(types: !115)
!115 = !{!111, !116, !16}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!118 = !{!22, !119, !120}
!119 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 4)
!120 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 4)
!121 = !{!122}
!122 = !DITemplateTypeParameter(name: "element", type: !101)
!123 = !{i32 2, !"Dwarf Version", i32 4}
!124 = !{i32 2, !"Debug Info Version", i32 3}
!125 = !{!"dxc 1.2"}
