#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; WPOSITION                0   xyzw        0     NONE   float       
; VPOSITION                0   xyzw        1     NONE   float       
; NORMAL                   0   xyz         2     NONE   float       
; NORMAL                   1   xyz         3     NONE   float       
; TEXCOORD                 0   xy          4     NONE   float       
; TEXCOORD                 1   xyz         5     NONE   float       
; SV_Position              0   xyzw        6      POS   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: d597321fad0b1783b92b3e433d77b59f.lld
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; WPOSITION                0                 linear       
; VPOSITION                0                 linear       
; NORMAL                   0                 linear       
; NORMAL                   1                 linear       
; TEXCOORD                 0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !84)
!1 = !DIFile(filename: "Shaders\5CShaders\5CStandardPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !6, templateParams: !21)
!6 = !{!7, !9, !17}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !5, file: !1, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QBAAAMI@Z", scope: !5, file: !1, type: !10, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !16}
!12 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !13)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QAAAAMI@Z", scope: !5, file: !1, type: !18, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!12, !20, !16}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !13)
!23 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !26, templateParams: !37)
!26 = !{!27, !28, !33}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !25, file: !1, baseType: !8, size: 32, align: 32)
!28 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QBAAAMI@Z", scope: !25, file: !1, type: !29, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!29 = !DISubroutineType(types: !30)
!30 = !{!12, !31, !16}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!33 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QAAAAMI@Z", scope: !25, file: !1, type: !34, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!34 = !DISubroutineType(types: !35)
!35 = !{!12, !36, !16}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!37 = !{!22, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!39 = !{!40, !68, !71, !75, !78, !81}
!40 = !DISubprogram(name: "main", scope: !41, file: !41, line: 114, type: !42, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!41 = !DIFile(filename: "Shaders\5CStandardPS.hlsl", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!24, !44}
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !41, line: 58, size: 736, align: 32, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !66, !67}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "positionWS", scope: !44, file: !41, line: 60, baseType: !24, size: 128, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "positionVS", scope: !44, file: !41, line: 61, baseType: !24, size: 128, align: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "normalVS", scope: !44, file: !41, line: 62, baseType: !4, size: 96, align: 32, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "normalWS", scope: !44, file: !41, line: 63, baseType: !4, size: 96, align: 32, offset: 352)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "texCoord", scope: !44, file: !41, line: 64, baseType: !51, size: 64, align: 32, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !53, templateParams: !64)
!53 = !{!54, !55, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !52, file: !1, baseType: !8, size: 32, align: 32)
!55 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QBAAAMI@Z", scope: !52, file: !1, type: !56, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!12, !58, !16}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!60 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QAAAAMI@Z", scope: !52, file: !1, type: !61, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{!12, !63, !16}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!64 = !{!22, !65}
!65 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "viewDirWS", scope: !44, file: !41, line: 65, baseType: !4, size: 96, align: 32, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !44, file: !41, line: 66, baseType: !24, size: 128, align: 32, offset: 608)
!68 = !DISubprogram(name: "CalculateSpecularBrdf", linkageName: "\01?CalculateSpecularBrdf@@YA?AV?$vector@M$02@@V1@000M00MMM@Z", scope: !41, file: !41, line: 70, type: !69, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!4, !4, !4, !4, !4, !13, !4, !4, !13, !13, !13}
!71 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !72, file: !72, line: 13, type: !73, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DIFile(filename: "Shaders/BRDFFunctions.hlsli", directory: "")
!73 = !DISubroutineType(types: !74)
!74 = !{!13, !4, !4, !13}
!75 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMMMM@Z", scope: !72, file: !72, line: 52, type: !76, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!13, !13, !13, !13}
!78 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !72, file: !72, line: 36, type: !79, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!13, !13, !13}
!81 = !DISubprogram(name: "FresnelSchlick", linkageName: "\01?FresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !72, file: !72, line: 68, type: !82, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!4, !13, !4}
!84 = !{!85, !87, !89, !105, !109, !111, !113}
!85 = !DIGlobalVariable(name: "Fdielectric", scope: !0, file: !41, line: 7, type: !86, isLocal: true, isDefinition: true)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!87 = !DIGlobalVariable(name: "Epsilon", scope: !0, file: !41, line: 9, type: !88, isLocal: true, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!89 = !DIGlobalVariable(name: "OmniLightData", linkageName: "\01?OmniLightData@@3V?$StructuredBuffer@ULightData@@@@A", scope: !0, file: !41, line: 45, type: !90, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<LightData>"* @"\01?OmniLightData@@3V?$StructuredBuffer@ULightData@@@@A")
!90 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<LightData>", file: !1, line: 45, size: 448, align: 32, elements: !91, templateParams: !103)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !90, file: !1, line: 45, baseType: !93, size: 448, align: 32)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !94, line: 36, size: 448, align: 32, elements: !95)
!94 = !DIFile(filename: "Shaders/StandardStructures.hlsli", directory: "")
!95 = !{!96, !97, !98, !99, !101, !102}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !93, file: !94, line: 38, baseType: !4, size: 96, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "RadiusSq", scope: !93, file: !94, line: 39, baseType: !13, size: 32, align: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !93, file: !94, line: 40, baseType: !4, size: 96, align: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !93, file: !94, line: 42, baseType: !100, size: 32, align: 32, offset: 224)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 151, baseType: !16)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ConeDirection", scope: !93, file: !94, line: 43, baseType: !4, size: 96, align: 32, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ConeAngles", scope: !93, file: !94, line: 44, baseType: !4, size: 96, align: 32, offset: 352)
!103 = !{!104}
!104 = !DITemplateTypeParameter(name: "element", type: !93)
!105 = !DIGlobalVariable(name: "LinearRepeatSampler", linkageName: "\01?LinearRepeatSampler@@3USamplerState@@A", scope: !0, file: !41, line: 55, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 55, size: 32, align: 32, elements: !107)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !106, file: !1, line: 55, baseType: !8, size: 32, align: 32, flags: DIFlagPrivate)
!109 = !DIGlobalVariable(name: "Fdielectric.0", linkageName: "Fdielectric.0", scope: !0, file: !41, line: 7, type: !110, isLocal: false, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !86, size: 32, align: 4)
!111 = !DIGlobalVariable(name: "Fdielectric.1", linkageName: "Fdielectric.1", scope: !0, file: !41, line: 7, type: !112, isLocal: false, isDefinition: true)
!112 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !86, size: 32, align: 4, offset: 32)
!113 = !DIGlobalVariable(name: "Fdielectric.2", linkageName: "Fdielectric.2", scope: !0, file: !41, line: 7, type: !114, isLocal: false, isDefinition: true)
!114 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !86, size: 32, align: 4, offset: 64)
!115 = !{i32 2, !"Dwarf Version", i32 4}
!116 = !{i32 2, !"Debug Info Version", i32 3}
!117 = !{!"dxc 1.2"}
